app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-02-16 23:40:09.175767"], ["updated_at", "2019-02-16 23:40:09.175767"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2019-02-16 23:40:09.187232"], ["updated_at", "2019-02-16 23:40:09.187232"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
---
  def upload
      CSV.foreach(params[:songs].path, headers: true) do |song|
      artist = Artist.find_or_create_by(name: song[1])